GopalSaraf/Practicals/PSDL/include/proc/pic16f18857.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 071Ah
// bitfield definitions
PIE4_TMR1IE_POSN                         equ 0000h
PIE4_TMR1IE_POSITION                     equ 0000h
PIE4_TMR1IE_SIZE                         equ 0001h
PIE4_TMR1IE_LENGTH                       equ 0001h
PIE4_TMR1IE_MASK                         equ 0001h
PIE4_TMR2IE_POSN                         equ 0001h
PIE4_TMR2IE_POSITION                     equ 0001h
PIE4_TMR2IE_SIZE                         equ 0001h
PIE4_TMR2IE_LENGTH                       equ 0001h
PIE4_TMR2IE_MASK                         equ 0002h
PIE4_TMR3IE_POSN                         equ 0002h
PIE4_TMR3IE_POSITION                     equ 0002h
PIE4_TMR3IE_SIZE                         equ 0001h
PIE4_TMR3IE_LENGTH                       equ 0001h
PIE4_TMR3IE_MASK                         equ 0004h
PIE4_TMR4IE_POSN                         equ 0003h
PIE4_TMR4IE_POSITION                     equ 0003h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0008h
PIE4_TMR5IE_POSN                         equ 0004h
PIE4_TMR5IE_POSITION                     equ 0004h
PIE4_TMR5IE_SIZE                         equ 0001h
PIE4_TMR5IE_LENGTH                       equ 0001h
PIE4_TMR5IE_MASK                         equ 0010h
PIE4_TMR6IE_POSN                         equ 0005h
PIE4_TMR6IE_POSITION                     equ 0005h
PIE4_TMR6IE_SIZE                         equ 0001h
PIE4_TMR6IE_LENGTH                       equ 0001h
PIE4_TMR6IE_MASK                         equ 0020h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 071Bh
// bitfield definitions
PIE5_TMR1GIE_POSN                        equ 0000h
PIE5_TMR1GIE_POSITION                    equ 0000h
PIE5_TMR1GIE_SIZE                        equ 0001h
PIE5_TMR1GIE_LENGTH                      equ 0001h
PIE5_TMR1GIE_MASK                        equ 0001h
PIE5_TMR3GIE_POSN                        equ 0001h
PIE5_TMR3GIE_POSITION                    equ 0001h
PIE5_TMR3GIE_SIZE                        equ 0001h
PIE5_TMR3GIE_LENGTH                      equ 0001h
PIE5_TMR3GIE_MASK                        equ 0002h
PIE5_TMR5GIE_POSN                        equ 0002h
PIE5_TMR5GIE_POSITION                    equ 0002h
PIE5_TMR5GIE_SIZE                        equ 0001h
PIE5_TMR5GIE_LENGTH                      equ 0001h
PIE5_TMR5GIE_MASK                        equ 0004h
PIE5_CLC1IE_POSN                         equ 0004h
PIE5_CLC1IE_POSITION                     equ 0004h
PIE5_CLC1IE_SIZE                         equ 0001h
PIE5_CLC1IE_LENGTH                       equ 0001h
PIE5_CLC1IE_MASK                         equ 0010h
PIE5_CLC2IE_POSN                         equ 0005h
PIE5_CLC2IE_POSITION                     equ 0005h
PIE5_CLC2IE_SIZE                         equ 0001h
PIE5_CLC2IE_LENGTH                       equ 0001h
PIE5_CLC2IE_MASK                         equ 0020h
PIE5_CLC3IE_POSN                         equ 0006h
PIE5_CLC3IE_POSITION                     equ 0006h
PIE5_CLC3IE_SIZE                         equ 0001h
PIE5_CLC3IE_LENGTH                       equ 0001h
PIE5_CLC3IE_MASK                         equ 0040h
PIE5_CLC4IE_POSN                         equ 0007h
PIE5_CLC4IE_POSITION                     equ 0007h
PIE5_CLC4IE_SIZE                         equ 0001h
PIE5_CLC4IE_LENGTH                       equ 0001h
PIE5_CLC4IE_MASK                         equ 0080h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 071Ch
// bitfield definitions
PIE6_CCP1IE_POSN                         equ 0000h
PIE6_CCP1IE_POSITION                     equ 0000h
PIE6_CCP1IE_SIZE                         equ 0001h
PIE6_CCP1IE_LENGTH                       equ 0001h
PIE6_CCP1IE_MASK                         equ 0001h
PIE6_CCP2IE_POSN                         equ 0001h
PIE6_CCP2IE_POSITION                     equ 0001h
PIE6_CCP2IE_SIZE                         equ 0001h
PIE6_CCP2IE_LENGTH                       equ 0001h
PIE6_CCP2IE_MASK                         equ 0002h
PIE6_CCP3IE_POSN                         equ 0002h
PIE6_CCP3IE_POSITION                     equ 0002h
PIE6_CCP3IE_SIZE                         equ 0001h
PIE6_CCP3IE_LENGTH                       equ 0001h
PIE6_CCP3IE_MASK                         equ 0004h
PIE6_CCP4IE_POSN                         equ 0003h
PIE6_CCP4IE_POSITION                     equ 0003h
PIE6_CCP4IE_SIZE                         equ 0001h
PIE6_CCP4IE_LENGTH                       equ 0001h
PIE6_CCP4IE_MASK                         equ 0008h
PIE6_CCP5IE_POSN                         equ 0004h
PIE6_CCP5IE_POSITION                     equ 0004h
PIE6_CCP5IE_SIZE                         equ 0001h
PIE6_CCP5IE_LENGTH                       equ 0001h
PIE6_CCP5IE_MASK                         equ 0010h

// Register: PIE7
#define PIE7 PIE7
PIE7                                     equ 071Dh
// bitfield definitions
PIE7_CWG1IE_POSN                         equ 0000h
PIE7_CWG1IE_POSITION                     equ 0000h
PIE7_CWG1IE_SIZE                         equ 0001h
PIE7_CWG1IE_LENGTH                       equ 0001h
PIE7_CWG1IE_MASK                         equ 0001h
PIE7_CWG2IE_POSN                         equ 0001h
PIE7_CWG2IE_POSITION                     equ 0001h
PIE7_CWG2IE_SIZE                         equ 0001h
PIE7_CWG2IE_LENGTH                       equ 0001h
PIE7_CWG2IE_MASK                         equ 0002h
PIE7_CWG3IE_POSN                         equ 0002h
PIE7_CWG3IE_POSITION                     equ 0002h
PIE7_CWG3IE_SIZE                         equ 0001h
PIE7_CWG3IE_LENGTH                       equ 0001h
PIE7_CWG3IE_MASK                         equ 0004h
PIE7_NCO1IE_POSN                         equ 0004h
PIE7_NCO1IE_POSITION                     equ 0004h
PIE7_NCO1IE_SIZE                         equ 0001h
PIE7_NCO1IE_LENGTH                       equ 0001h
PIE7_NCO1IE_MASK                         equ 0010h
PIE7_NVMIE_POSN                          equ 0005h
PIE7_NVMIE_POSITION                      equ 0005h
PIE7_NVMIE_SIZE                          equ 0001h
PIE7_NVMIE_LENGTH                        equ 0001h
PIE7_NVMIE_MASK                          equ 0020h
PIE7_CRCIE_POSN                          equ 0006h
PIE7_CRCIE_POSITION                      equ 0006h
PIE7_CRCIE_SIZE                          equ 0001h
PIE7_CRCIE_LENGTH                        equ 0001h
PIE7_CRCIE_MASK                          equ 0040h
PIE7_SCANIE_POSN                         equ 0007h
PIE7_SCANIE_POSITION                     equ 0007h
PIE7_SCANIE_SIZE                         equ 0001h
PIE7_SCANIE_LENGTH                       equ 0001h
PIE7_SCANIE_MASK                         equ 0080h
PIE7_NCOIE_POSN                          equ 0004h
PIE7_NCOIE_POSITION                      equ 0004h
PIE7_NCOIE_SIZE                          equ 0001h
PIE7_NCOIE_LENGTH                        equ 0001h
PIE7_NCOIE_MASK                          equ 0010h

// Register: PIE8
#define PIE8 PIE8
PIE8                                     equ 071Eh
// bitfield definitions
PIE8_SMT1IE_POSN                         equ 0000h
PIE8_SMT1IE_POSITION                     equ 0000h
PIE8_SMT1IE_SIZE                         equ 0001h
PIE8_SMT1IE_LENGTH                       equ 0001h
PIE8_SMT1IE_MASK                         equ 0001h
PIE8_SMT1PRAIE_POSN                      equ 0001h
PIE8_SMT1PRAIE_POSITION                  equ 0001h
PIE8_SMT1PRAIE_SIZE                      equ 0001h
PIE8_SMT1PRAIE_LENGTH                    equ 0001h
PIE8_SMT1PRAIE_MASK                      equ 0002h
PIE8_SMT1PWAIE_POSN                      equ 0002h
PIE8_SMT1PWAIE_POSITION                  equ 0002h
PIE8_SMT1PWAIE_SIZE                      equ 0001h
PIE8_SMT1PWAIE_LENGTH                    equ 0001h
PIE8_SMT1PWAIE_MASK                      equ 0004h
PIE8_SMT2IE_POSN                         equ 0003h
PIE8_SMT2IE_POSITION                     equ 0003h
PIE8_SMT2IE_SIZE                         equ 0001h
PIE8_SMT2IE_LENGTH                       equ 0001h
PIE8_SMT2IE_MASK                         equ 0008h
PIE8_SMT2PRAIE_POSN                      equ 0004h
PIE8_SMT2PRAIE_POSITION                  equ 0004h
PIE8_SMT2PRAIE_SIZE                      equ 0001h
PIE8_SMT2PRAIE_LENGTH                    equ 0001h
PIE8_SMT2PRAIE_MASK                      equ 0010h
PIE8_SMT2PWAIE_POSN                      equ 0005h
PIE8_SMT2PWAIE_POSITION                  equ 0005h
PIE8_SMT2PWAIE_SIZE                      equ 0001h
PIE8_SMT2PWAIE_LENGTH                    equ 0001h
PIE8_SMT2PWAIE_MASK                      equ 0020h

